{

	"music": [
		


{

			"title": "Alexander Isak: Newcastle United sign Sweden striker from Real Sociedad",
			"cover": "https://icdn.football-espana.net/wp-content/uploads/2022/07/alexander-isak-real-sociedad-1-scaled.jpg",
			"track": "Newcastle have signed Sweden striker Alexander Isak from Real Sociedad on a long-term deal understood to be worth about £60m.  ",
			"term": "EFL CUP"
		},
		{

			"title": "Alexander Isak: The Newcastle signing shaking off his 'new' Zlatan Ibrahimovic tag",
			"cover": "https://talksport.com/wp-content/uploads/sites/5/2022/02/isak.jpg?strip=all&w=960&quality=100",
			"track": "The big Stockholm derby between Djurgarden and AIK was on 21 September 2016, and Alexander Isak made sure it was an evening to remember.In the first half, AIK's teenage sensation made a run into space and expertly controlled a through ball in the box. One touch to take it into his stride, a second to fire low and hard into the far corner. Arms outstretched, he stood celebrating in front of the hostile home crowd.After the break, he stole into a scoring position with perfect timing and added a brilliant header, doubling the lead and sending his club's fans wild with joy. That night AIK celebrated an emphatic 3-0 win over bitter rivals that kept their championship title dream alive.Chinedu Obasi, the Nigerian who netted the third goal, said: 'Isak has enormous potential. If everything goes well, he could become Sweden's new Zlatan Ibrahimovic'.  ",
			"term": "EFL CUP"
		},
		{

			"title": "Matheus Nunes: From working in a bakery to becoming Wolves' record signing",
			"cover": "https://ichef.bbci.co.uk/onesport/cps/800/cpsprodpb/1474F/production/_126419738_gettyimages-1416056887.jpg",
			"track": "Sporting Lisbon boss Ruben Amorim had a peculiar way of encouraging Matheus Nunes during training sessions.Amorim would often approach the young Portugal midfielder and tell him he needed to work harder than his colleagues. The reason was simple: Nunes had to pay for his manager's signing.He was joking, albeit perhaps not entirely.Having taken the unprecedented gamble of paying a fee of 10m euros for a coach whose top-flight experience was close to none, club president Frederico Varandas made a bold prediction as he denied any concern about the finances of the deal.'I have absolutely no doubt that Nunes alone will pay for Amorim. You can write it down,' he said in an interview with Canal 11 in May 2020.  ",
			"term": "EFL CUP"
		},
		{

			"title": "Champions League draw: Liverpool to meet Rangers and Celtic face Real Madrid",
			"cover": "https://i.pinimg.com/originals/b1/4a/f0/b14af08dd38d252bfe2391cda832ea4c.png",
			"track": "Liverpool and Rangers will meet in the Champions League group stage, while Manchester City's Erling Haaland is set to face his old club Borussia Dortmund.Scottish champions Celtic are in the same group as holders Real Madrid and Chelsea face AC Milan.Eintracht Frankfurt, who are making their group stage debut, are in the same group as Tottenham.Bayern Munich, Barcelona and Inter Milan have been drawn in the same group",
			"term": "EFL CUP"
		},
		{

			"title": "Nicolas Pepe: Nice sign Arsenal and Ivory Coast winger on season-long loan",
			"cover": "https://ichef.bbci.co.uk/onesport/cps/800/cpsprodpb/1D6D/production/_126433570_gettyimages-1410562716.jpg",
			"track": "Ligue 1 club Nice have signed Arsenal winger Nicolas Pepe on loan.The season-long deal does not include an option to buy the 27-year-old, who started just five times for the Gunners last season.Pepe joined the north London side for a club-record £72m from Lille in 2019 but has not been able to establish himself in the Premier League.'Everyone at Arsenal wishes Nico well in France with Nice next season,' the club said.  ",
			"term": "EFL CUP"
		},
		{

			"title": "West Ham put their poor Premier League form behind them to reach the group stage of the Europa Conference League",
			"cover": "https://ichef.bbci.co.uk/onesport/cps/800/cpsprodpb/11CE6/production/_126443927_shutterstock_editorial_13270685aw.jpg",
			"track": "The Hammers, who have lost their opening three domestic games, demolished Viborg 6-1 on aggregate in the play-off round.Leading 3-1 from the first leg, David Moyes' side extended their lead on aggregate through Italy forward Gianluca Scamacca in Denmark.Said Benrahma made it 2-0 on the night before Tomas Soucek added a third.The Hammers will discover their group-stage opponents on Friday, with Moyes' side now facing six Europa Conference League games between 8 September and 3 November. ",
			"term": "EFL CUP"
		},
		{

			"title": "West Ham step up Lucas Paqueta and Hans Vanaken talks after latest bids rejected",
			"cover": "https://static.standard.co.uk/2022/08/16/08/newFile.jpg?width=640&auto=webp&quality=50&crop=1996%3A1330%2Csmart",
			"track": "est Ham’s hunt for an attacking midfielder looks set to go to the wire after their latest bids for Lyon star Lucas Paqueta and Club Brugge’s Hans Vanaken were rejected.The Hammers made a €40million offer for Brazil international Paqueta, as well as a bid worth around £10m for Belgian Vanaken but both have been turned down.Neither deal is dead, with talks continuing with both clubs, but with just a week to go until deadline day, the Irons are running low on time to complete what has been a summer-long search.The latest setbacks are sure to frustrate David Moyes, who on Wednesday admitted to struggling to convince some targets to join West Ham due to the size of the club. ⚽️ ",
			"term": "EFL CUP"
		},
		{

			"title": "Man United submitting £25m Cody Gakpo take-it-or-leave-it bid today",
			"cover": "https://www.footballinsider247.com/static/uploads/1/2022/08/GettyImages-1242237795-1-1024x703.jpg",
			"track": "Man United are submitting a £25million take-it-or-leave-it bid for PSV Eindhoven star Cody Gakpo on Thursday (25 August), sources have told Football Insider.The Premier League giants have readied their offer for Gapko, 23, while also pursuing Ajax sensation Antony. ",
			"term": "EFL CUP"
		},
		{

			"title": "Neal Maupay: Brighton forward undergoing Everton medical as club look to seal move before Brentford game",
			"cover": "https://e0.365dm.com/22/08/1600x900/skysports-neal-maupay-brighton_5876258.jpg?20220825220432",
			"track": "Brighton striker Neal Maupay is undergoing his Everton medical at as they look to add to their forward line before the end of the transfer window.The 26-year-old looked like he would join Fulham this week, but Frank Lampard is desperate to bring in reinforcements in the forward positions.Everton are hopeful a deal can be struck in time for him to face his former club Brentford on Saturday but there is still some work to do to complete negotiations before midday on Friday. ",
			"term": "EFL CUP"
		},
		{

			"title": "Southampton boss firmly denies any suggestion Che Adams could leave this window",
			"cover": "https://www.dailyecho.co.uk/resources/images/14551727.jpg?type=responsive-gallery-fullscreen",
			"track": "Newcastle have signed Sweden striker Alexander Isak from Real Sociedad on a long-term deal understood to be worth about £60m. ⚽️ ",
			"term": "EFL CUP"
		}
		
		
	

	]


}
